app/controllers/sentences_controller.rb

  def index
    @sentences = Sentence.where("user_id = ?", @current_user).order("updated_at DESC").limit(20)
---
SELECT "sentences".* FROM "sentences" WHERE (user_id = 1) ORDER BY updated_at DESC LIMIT 20

  def show
    unless self.check_user(Sentence, params[:id]) == 'stop'
      @sentence_id = params[:id]
      @sentence = Sentence.find @sentence_id
      @words = Word.where("sentence_id = ?", @sentence).order("updated_at DESC")
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "words".* FROM "words" WHERE (sentence_id = 3) ORDER BY updated_at DESC

  def create
    @sentence = Sentence.new(params[:sentence])
    @sentence.user = @current_user
    if @sentence.save
---
INSERT INTO "sentences" ("created_at", "in_chinese", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 04 Jul 2013 10:01:36 UTC +00:00], ["in_chinese", "第一句 "], ["title", "this 看起来非常不错啊"], ["updated_at", Thu, 04 Jul 2013 10:01:36 UTC +00:00], ["user_id", 1]]

  def edit
    unless self.check_user(Sentence, params[:id]) == 'stop'
      @sentence = Sentence.find params[:id]
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    unless self.check_user(Sentence, params[:id]) == 'stop'
      @sentence = Sentence.find params[:id]
      if @sentence.update_attributes params[:sentence]
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sentences" SET "title" = '第一天可以连接单词的句子', "updated_at" = '2013-07-04 12:20:00.000000' WHERE "sentences"."id" = 6

  def destroy
    unless self.check_user(Sentence, params[:id]) == 'stop'
      @sentence = Sentence.find(params[:id])
      @sentence.destroy
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "sentences" WHERE "sentences"."id" = ?  [["id", 1]]