app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = '100001499656133' LIMIT 1
---
  def home
    @current_user ||= User.find_by_uid(session[:uid])

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 26 Jun 2013 17:26:12 UTC +00:00], ["name", "Brian Yao"], ["provider", "facebook"], ["uid", "100001499656133"], ["updated_at", Wed, 26 Jun 2013 17:26:12 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'facebook' AND "users"."uid" = '100001499656133' LIMIT 1
---
  def create
    # reset_session
    auth = request.env['omniauth.auth']
    # render :text => auth.inspect
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) ||
      User.create_with_omniauth(auth)

SELECT "sentences".* FROM "sentences"
SELECT "words".* FROM "words"
---
  def admin
    @sentences = Sentence.all
    @words = Word.all

SELECT "sentences".* FROM "sentences" WHERE ("sentences"."created_at" BETWEEN '2013-07-01 20:50:00' AND '2013-07-05 02:50:00')
---
  def gen
    @gen =Gen.new
    if not params[:gen]
      @gen.file_name = "宿題_" + Time.now.strftime("%Y年%m月%d日") + '_' + @current_user.name
      @gen.from = Time.now.ago(12.hours).since(60)
      @gen.to = Time.now.since(60)
    else
      @gen.file_name = params[:gen][:file_name]
      @gen.from = @gen.parse_datetime_params(params[:gen], :from, :utc).change(:offset => DateTime.now.zone)
      @gen.to = @gen.parse_datetime_params(params[:gen], :to, :utc).change(:offset => DateTime.now.zone)
    end
    if params[:commit] == "查看结果"
      @sentences = Sentence.where(["created_at >= ? AND created_at <= ?", @gen.from, @gen.to])