app/controllers/words_controller.rb

SELECT "words".* FROM "words" WHERE (user_id = 1) ORDER BY (CASE WHEN attempt_count <> 0 THEN (failed_count / attempt_count) ELSE 0 END) DESC,
SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "37"]]
UPDATE "words" SET "attempt_count" = 4, "failed_count" = 1, "updated_at" = '2013-07-02 14:02:12.258754' WHERE "words"."id" = 37
---
  def ji
    @words = Word.where("user_id = ?", @current_user).order("(
      CASE
        When (attempt_count = failed_count) THEN failed_count
        WHEN (attempt_count <> 0 AND failed_count = 0) THEN ((-1)*attempt_count)
        WHEN (attempt_count <> 0 AND failed_count <> 0) THEN (failed_count / attempt_count)
        ELSE 0
      END
      ) DESC,
      updated_at").limit(20)
    if request.put?
      @word = Word.find params[:id]
      @word.attempt_count += 1

      if params[:recall] == 'no'
        @word.failed_count += 1
        flash.now[:notice] = "😞忘记“#{@word.title}”+1"
      elsif params[:recall] == 'yes'
        flash.now[:notice] = "😁记住“#{@word.title}”+1"
      else
        flash.now[:warning] = "Error on return recall value"
      end

      if @word.save

SELECT "words".* FROM "words" WHERE (user_id = 1) ORDER BY updated_at DESC LIMIT 20
---
  def index
    @words = Word.where("user_id = ?", @current_user).order("updated_at DESC").limit(20)

INSERT INTO "words" ("add_date", "attempt_count", "created_at", "failed_count", "in_chinese", "sentence_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @word = Word.new(params[:word])
    @word.user = @current_user
    @word.attempt_count = 0
    @word.failed_count = 0
    @sentence_id = params[:sentence_id]
    if @sentence_id
      @word.sentence_id = @sentence_id.to_i
    end
    if @word.save

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    unless self.check_user(Word, params[:id]) == 'stop'
      id = params[:id] # retrieve movie ID from URI route
      @word = Word.find(id) # look up movie by unique ID

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "37"]]
SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    unless self.check_user(Word, params[:id]) == 'stop'
      @word = Word.find params[:id]
      @word.updated_at = Time.now
      if @word.sentence_id
        @sentence = Sentence.find @word.sentence_id

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "words" SET "title" = '宿题', "in_chinese" = '作业', "add_date" = '2013-06-13 00:00:00.000000', "updated_at" = '2013-06-13 16:22:57.345766' WHERE "words"."id" = 3
---
  def update
    unless self.check_user(Word, params[:id]) == 'stop'
      @word = Word.find params[:id]
      if @word.update_attributes params[:word]

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 1]]
---
  def destroy
    unless self.check_user(Word, params[:id]) == 'stop'
      @word = Word.find(params[:id])
      @word.destroy